candykingdom/firefly-v2-board/boards.txt
# Firefly v2 board
firefly2_custom.name=Firefly v2 (SAMD21E17A)
firefly2_custom.vid.0=0x03EB
firefly2_custom.pid.0=0x2402
firefly2_custom.upload.tool=bossac
firefly2_custom.upload.protocol=sam-ba
firefly2_custom.upload.maximum_size=131072
firefly2_custom.upload.use_1200bps_touch=true
firefly2_custom.upload.wait_for_upload_port=true
firefly2_custom.upload.native_usb=true
firefly2_custom.build.mcu=cortex-m0plus
firefly2_custom.build.f_cpu=48000000L
firefly2_custom.build.usb_product="Firefly v2"
firefly2_custom.build.usb_manufacturer="Candy Kingdom"
firefly2_custom.build.board=FIREFLY_V2
firefly2_custom.build.core=arduino
firefly2_custom.build.extra_flags=-DCRYSTALLESS -D__SAMD21E17A__ -DCANDYKINGDOM_FIREFLY_V2 {build.usb_flags}
firefly2_custom.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
firefly2_custom.build.openocdscript=openocd_scripts/arduino_zero.cfg
firefly2_custom.build.variant=firefly_v2
firefly2_custom.build.variant_system_lib=
firefly2_custom.build.vid=0x03EB
firefly2_custom.build.pid=0x2402
firefly2_custom.bootloader.tool=openocd
# TODO
firefly2_custom.bootloader.file=trinket/bootloader_uf2.bin

# RFBoard (Devboard)
rfboard.name=rfboard (SAMD21E17A)
rfboard.vid.0=0x03EB
rfboard.pid.0=0x2402
rfboard.upload.tool=bossac
rfboard.upload.protocol=sam-ba
rfboard.upload.maximum_size=131072
rfboard.upload.use_1200bps_touch=true
rfboard.upload.wait_for_upload_port=true
rfboard.upload.native_usb=true
rfboard.build.mcu=cortex-m0plus
rfboard.build.f_cpu=48000000L
rfboard.build.usb_product="rfboard"
rfboard.build.usb_manufacturer="Candy Kingdom"
rfboard.build.board=RFBOARD
rfboard.build.core=arduino
rfboard.build.extra_flags=-DCRYSTALLESS -D__SAMD21E17A__ -DCANDYKINGDOM_FIREFLY_RFBOARD {build.usb_flags}
rfboard.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
rfboard.build.openocdscript=openocd_scripts/arduino_zero.cfg
rfboard.build.variant=rfboard
rfboard.build.variant_system_lib=
rfboard.build.vid=0x03EB
rfboard.build.pid=0x2402
rfboard.bootloader.tool=openocd
# TODO
rfboard.bootloader.file=trinket/bootloader_uf2.bin

# Battery protector v2
hvacv2.name=HVAC v2 (SAMD21E17A)
hvacv2.vid.0=0x03EB
hvacv2.pid.0=0x2402
hvacv2.upload.tool=bossac
hvacv2.upload.protocol=sam-ba
hvacv2.upload.maximum_size=131072
hvacv2.upload.use_1200bps_touch=true
hvacv2.upload.wait_for_upload_port=true
hvacv2.upload.native_usb=true
hvacv2.build.mcu=cortex-m0plus
hvacv2.build.f_cpu=48000000L
hvacv2.build.usb_product="hvac-v2"
hvacv2.build.usb_manufacturer="Candy Kingdom"
hvacv2.build.board=HVAC_V2
hvacv2.build.core=arduino
hvacv2.build.extra_flags=-DCRYSTALLESS -D__SAMD21E17A__ -DCANDYKINGDOM_FIREFLY_HVAC_V2 {build.usb_flags}
hvacv2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hvacv2.build.openocdscript=openocd_scripts/arduino_zero.cfg
hvacv2.build.variant=hvac_v2
hvacv2.build.variant_system_lib=
hvacv2.build.vid=0x03EB
hvacv2.build.pid=0x2402
hvacv2.bootloader.tool=openocd
# TODO
hvacv2.bootloader.file=trinket/bootloader_uf2.bin


# Battery protector v2
bpv2.name=Battery protector v2 (SAMD21E17A)
bpv2.vid.0=0x03EB
bpv2.pid.0=0x2402
bpv2.upload.tool=bossac
bpv2.upload.protocol=sam-ba
bpv2.upload.maximum_size=131072
bpv2.upload.use_1200bps_touch=true
bpv2.upload.wait_for_upload_port=true
bpv2.upload.native_usb=true
bpv2.build.mcu=cortex-m0plus
bpv2.build.f_cpu=48000000L
bpv2.build.usb_product="battery-protector-v2"
bpv2.build.usb_manufacturer="Candy Kingdom"
bpv2.build.board=BATTERY_PROTECTOR_V2
bpv2.build.core=arduino
bpv2.build.extra_flags=-DCRYSTALLESS -D__SAMD21E17A__ -DCANDYKINGDOM_FIREFLY_BATTERY_PROTECTOR_V2 {build.usb_flags}
bpv2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
bpv2.build.openocdscript=openocd_scripts/arduino_zero.cfg
bpv2.build.variant=battery_protector_v2
bpv2.build.variant_system_lib=
bpv2.build.vid=0x03EB
bpv2.build.pid=0x2402
bpv2.bootloader.tool=openocd
# TODO
bpv2.bootloader.file=trinket/bootloader_uf2.bin

